In [1]:
import pandas as pd

In [2]:
movies = pd.read_pickle("datasets\movies.p")

In [3]:
movies.head()

      id                 title  popularity release_date
0    257          Oliver Twist   20.415572   2005-09-23
1  14290  Better Luck Tomorrow    3.877036   2002-01-12
2  38365             Grown Ups   38.864027   2010-06-24
3   9672              Infamous    3.680896   2006-11-16
4  12819       Alpha and Omega   12.300789   2010-09-17

In [4]:
movies.shape

(4803, 4)

In [6]:
taglines = pd.read_pickle("datasets/taglines.p")

In [10]:
financials = pd.read_pickle("datasets/financials.p")

In [8]:
taglines.head()

       id                                         tagline
0   19995                     Enter the World of Pandora.
1     285  At the end of the world, the adventure begins.
2  206647                           A Plan No One Escapes
3   49026                                 The Legend Ends
4   49529            Lost in our world, found in another.

In [9]:
taglines.shape

(3955, 2)

In [11]:
financials.head()

       id     budget       revenue
0   19995  237000000  2.787965e+09
1     285  300000000  9.610000e+08
2  206647  245000000  8.806746e+08
3   49026  250000000  1.084939e+09
4   49529  260000000  2.841391e+08

In [12]:
financials.shape

(3229, 3)

## Counting missing rows with left join
The Movie Database is supported by volunteers going out into the world, collecting data, and entering it into the database. This includes financial data, such as movie budget and revenue. If you wanted to know which movies are still missing data, you could use a left join to identify them. Practice using a left join by merging the movies table and the financials table.

- Merge the movies table, as the left table, with the financials table using a left join, and save the result to movies_financials.

In [19]:
movies_financials = movies.merge(financials, on="id", how="left")

In [20]:
movies_financials.head()

,id,title,popularity,release_date,budget,revenue
0,257,Oliver Twist,20.415572,2005-09-23,50000000.0,42093706.0
1,14290,Better Luck Tomorrow,3.877036,2002-01-12,NaN,NaN
2,38365,Grown Ups,38.864027,2010-06-24,80000000.0,271430189.0
3,9672,Infamous,3.680896,2006-11-16,13000000.0,1151330.0
4,12819,Alpha and Omega,12.300789,2010-09-17,20000000.0,39300000.0

In [21]:
movies_financials.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4803 entries, 0 to 4802
Data columns (total 6 columns):
id              4803 non-null int64
title           4803 non-null object
popularity      4803 non-null float64
release_date    4802 non-null object
budget          3229 non-null float64
revenue         3229 non-null float64
dtypes: float64(3), int64(1), object(2)
memory usage: 262.7+ KB

In [22]:
# Count the number of rows in the budget column that are missing
number_of_missing_fin = movies_financials['budget'].isnull().sum()

# Print the number of movies missing financials
print(number_of_missing_fin)

1574